rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_AEC_AE.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_AEC_AE
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_AEC_AE_H_) /* Check if memory map has not been already included */
#define S32M24x_AEC_AE_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- AEC_AE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AEC_AE_Peripheral_Access_Layer AEC_AE Peripheral Access Layer
 * @{
 */

/** AEC_AE - Register Layout Typedef */
typedef struct {
    __I uint32_t VERID; /**< AEC Version ID, offset: 0x0 */
    uint8_t RESERVED_0[4];
    __IO uint16_t LOCK_CONTROL; /**< Lock Control, offset: 0x8 */
    uint8_t RESERVED_1[2];
    __IO uint32_t LPWU_CONTROL;  /**< Power Mode Control, offset: 0xC */
    __IO uint16_t EVENTS_STATUS; /**< Event Notifications Status, offset: 0x10 */
    uint8_t RESERVED_2[2];
    __IO uint16_t EVENTS_ENABLE; /**< Event Notifications Enable, offset: 0x14 */
    uint8_t RESERVED_3[2];
    __IO uint16_t FAULTS_STATUS; /**< Fault Notifications Status, offset: 0x18 */
    uint8_t RESERVED_4[2];
    __IO uint16_t FAULTS_ENABLE; /**< Fault Notifications Enable, offset: 0x1C */
    uint8_t RESERVED_5[2];
    __IO uint32_t NOTIFS_MONITOR; /**< Monitoring of Notifications, offset: 0x20 */
    __O uint32_t IRQ_SET;         /**< Set Status Bits, offset: 0x24 */
    __IO uint32_t SAFETY_ENABLE;  /**< Safety Enable, offset: 0x28 */
    __IO uint16_t SYSCLK_CHECK;   /**< System Clock Check, offset: 0x2C */
    uint8_t RESERVED_6[2];
    __IO uint16_t ALIVE_WD_CFG; /**< Alive Watchdog Configuration, offset: 0x30 */
    uint8_t RESERVED_7[2];
    __IO uint16_t ALIVE_WD_TOKEN; /**< Alive Watchdog Reference Value, offset: 0x34 */
    uint8_t RESERVED_8[2];
    __IO uint16_t ALIVE_WD_ANSWER; /**< Alive Watchdog Answer, offset: 0x38 */
    uint8_t RESERVED_9[2];
    __IO uint16_t FAULT_WD_CFG; /**< Fault Watchdog Configuration, offset: 0x3C */
    uint8_t RESERVED_10[2];
    __IO uint32_t CLKGEN_CFG; /**< Clock Generator Configuration, offset: 0x40 */
    __IO uint16_t RSTGEN_CFG; /**< Reset Generator Configuration, offset: 0x44 */
    uint8_t RESERVED_11[2];
    __IO uint32_t IO_FUNCMUX_CFG; /**< IO Funcmux Configuration, offset: 0x48 */
    uint8_t RESERVED_12[20];
    __IO uint16_t LINPHY_CFG; /**< LINPHY Configuration, offset: 0x60 */
    uint8_t RESERVED_13[2];
    __IO uint32_t LINPHY_MONITOR; /**< LINPHY Monitor, offset: 0x64 */
    uint8_t RESERVED_14[8];
    __IO uint16_t CANPHY_CFG; /**< CANPHY Configuration, offset: 0x70 */
    uint8_t RESERVED_15[2];
    __IO uint16_t CANPHY_MONITOR; /**< CANPHY Monitor, offset: 0x74 */
    uint8_t RESERVED_16[10];
    __IO uint32_t TMON_PHY;     /**< Temperature Monitor PHY, offset: 0x80 */
    __IO uint32_t TMON_PMC;     /**< Temperature Monitor PMC, offset: 0x84 */
    __IO uint16_t TMON_MONITOR; /**< TMON Monitor, offset: 0x88 */
    __IO uint16_t TMON_CHECK;   /**< TMON Check, offset: 0x8A */
} AEC_AE_Type, *AEC_AE_MemMapPtr;

/** Number of instances of the AEC_AE module. */
#define AEC_AE_INSTANCE_COUNT (1u)

/* AEC_AE - Peripheral instance base addresses */
/** Peripheral AEC_AE base address */
#define IP_AEC_AE_BASE (0u)
/** Peripheral AEC_AE base pointer */
#define IP_AEC_AE ((AEC_AE_Type*)IP_AEC_AE_BASE)
/** Array initializer of AEC_AE peripheral base addresses */
#define IP_AEC_AE_BASE_ADDRS                                                                       \
    {                                                                                              \
        IP_AEC_AE_BASE                                                                             \
    }
/** Array initializer of AEC_AE peripheral base pointers */
#define IP_AEC_AE_BASE_PTRS                                                                        \
    {                                                                                              \
        IP_AEC_AE                                                                                  \
    }

/* ----------------------------------------------------------------------------
   -- AEC_AE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AEC_AE_Register_Masks AEC_AE Register Masks
 * @{
 */

/*! @name VERID - AEC Version ID */
/*! @{ */

#define AEC_AE_VERID_MINOR_MASK (0xFU)
#define AEC_AE_VERID_MINOR_SHIFT (0U)
#define AEC_AE_VERID_MINOR_WIDTH (4U)
#define AEC_AE_VERID_MINOR(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_VERID_MINOR_SHIFT)) & AEC_AE_VERID_MINOR_MASK)

#define AEC_AE_VERID_VARIANT_MASK (0xF0U)
#define AEC_AE_VERID_VARIANT_SHIFT (4U)
#define AEC_AE_VERID_VARIANT_WIDTH (4U)
#define AEC_AE_VERID_VARIANT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_VERID_VARIANT_SHIFT)) & AEC_AE_VERID_VARIANT_MASK)

#define AEC_AE_VERID_MAJOR_MASK (0xFF00U)
#define AEC_AE_VERID_MAJOR_SHIFT (8U)
#define AEC_AE_VERID_MAJOR_WIDTH (8U)
#define AEC_AE_VERID_MAJOR(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_VERID_MAJOR_SHIFT)) & AEC_AE_VERID_MAJOR_MASK)

#define AEC_AE_VERID_ID_MASK (0xFFFF0000U)
#define AEC_AE_VERID_ID_SHIFT (16U)
#define AEC_AE_VERID_ID_WIDTH (16U)
#define AEC_AE_VERID_ID(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_VERID_ID_SHIFT)) & AEC_AE_VERID_ID_MASK)
/*! @} */

