rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
/*! @name LOCK_CONTROL - Lock Control */
/*! @{ */

#define AEC_AE_LOCK_CONTROL_AWDG_CFG_LOCK_MASK (0x1U)
#define AEC_AE_LOCK_CONTROL_AWDG_CFG_LOCK_SHIFT (0U)
#define AEC_AE_LOCK_CONTROL_AWDG_CFG_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_AWDG_CFG_LOCK(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_AWDG_CFG_LOCK_SHIFT)) &                    \
     AEC_AE_LOCK_CONTROL_AWDG_CFG_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_FWDG_CFG_LOCK_MASK (0x2U)
#define AEC_AE_LOCK_CONTROL_FWDG_CFG_LOCK_SHIFT (1U)
#define AEC_AE_LOCK_CONTROL_FWDG_CFG_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_FWDG_CFG_LOCK(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_FWDG_CFG_LOCK_SHIFT)) &                    \
     AEC_AE_LOCK_CONTROL_FWDG_CFG_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_TMON_CHK_LOCK_MASK (0x4U)
#define AEC_AE_LOCK_CONTROL_TMON_CHK_LOCK_SHIFT (2U)
#define AEC_AE_LOCK_CONTROL_TMON_CHK_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_TMON_CHK_LOCK(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_TMON_CHK_LOCK_SHIFT)) &                    \
     AEC_AE_LOCK_CONTROL_TMON_CHK_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_LPWU_CTL_LOCK_MASK (0x8U)
#define AEC_AE_LOCK_CONTROL_LPWU_CTL_LOCK_SHIFT (3U)
#define AEC_AE_LOCK_CONTROL_LPWU_CTL_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_LPWU_CTL_LOCK(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_LPWU_CTL_LOCK_SHIFT)) &                    \
     AEC_AE_LOCK_CONTROL_LPWU_CTL_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_CLKG_CFG_LOCK_MASK (0x10U)
#define AEC_AE_LOCK_CONTROL_CLKG_CFG_LOCK_SHIFT (4U)
#define AEC_AE_LOCK_CONTROL_CLKG_CFG_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_CLKG_CFG_LOCK(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_CLKG_CFG_LOCK_SHIFT)) &                    \
     AEC_AE_LOCK_CONTROL_CLKG_CFG_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_IRQ_SET_LOCK_MASK (0x20U)
#define AEC_AE_LOCK_CONTROL_IRQ_SET_LOCK_SHIFT (5U)
#define AEC_AE_LOCK_CONTROL_IRQ_SET_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_IRQ_SET_LOCK(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_IRQ_SET_LOCK_SHIFT)) &                     \
     AEC_AE_LOCK_CONTROL_IRQ_SET_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_RSTG_CFG_LOCK_MASK (0x40U)
#define AEC_AE_LOCK_CONTROL_RSTG_CFG_LOCK_SHIFT (6U)
#define AEC_AE_LOCK_CONTROL_RSTG_CFG_LOCK_WIDTH (1U)
#define AEC_AE_LOCK_CONTROL_RSTG_CFG_LOCK(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_RSTG_CFG_LOCK_SHIFT)) &                    \
     AEC_AE_LOCK_CONTROL_RSTG_CFG_LOCK_MASK)

#define AEC_AE_LOCK_CONTROL_UNLOCK_KEY_MASK (0xFF00U)
#define AEC_AE_LOCK_CONTROL_UNLOCK_KEY_SHIFT (8U)
#define AEC_AE_LOCK_CONTROL_UNLOCK_KEY_WIDTH (8U)
#define AEC_AE_LOCK_CONTROL_UNLOCK_KEY(x)                                                          \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LOCK_CONTROL_UNLOCK_KEY_SHIFT)) &                       \
     AEC_AE_LOCK_CONTROL_UNLOCK_KEY_MASK)
/*! @} */

/*! @name LPWU_CONTROL - Power Mode Control */
/*! @{ */

#define AEC_AE_LPWU_CONTROL_LPTIMER_CFG_MASK (0xFFFFU)
#define AEC_AE_LPWU_CONTROL_LPTIMER_CFG_SHIFT (0U)
#define AEC_AE_LPWU_CONTROL_LPTIMER_CFG_WIDTH (16U)
#define AEC_AE_LPWU_CONTROL_LPTIMER_CFG(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LPWU_CONTROL_LPTIMER_CFG_SHIFT)) &                      \
     AEC_AE_LPWU_CONTROL_LPTIMER_CFG_MASK)

#define AEC_AE_LPWU_CONTROL_SLEEP_REQ_MASK (0x10000U)
#define AEC_AE_LPWU_CONTROL_SLEEP_REQ_SHIFT (16U)
#define AEC_AE_LPWU_CONTROL_SLEEP_REQ_WIDTH (1U)
#define AEC_AE_LPWU_CONTROL_SLEEP_REQ(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LPWU_CONTROL_SLEEP_REQ_SHIFT)) &                        \
     AEC_AE_LPWU_CONTROL_SLEEP_REQ_MASK)

#define AEC_AE_LPWU_CONTROL_DEEP_SLEEP_REQ_MASK (0x20000U)
#define AEC_AE_LPWU_CONTROL_DEEP_SLEEP_REQ_SHIFT (17U)
#define AEC_AE_LPWU_CONTROL_DEEP_SLEEP_REQ_WIDTH (1U)
#define AEC_AE_LPWU_CONTROL_DEEP_SLEEP_REQ(x)                                                      \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LPWU_CONTROL_DEEP_SLEEP_REQ_SHIFT)) &                   \
     AEC_AE_LPWU_CONTROL_DEEP_SLEEP_REQ_MASK)

#define AEC_AE_LPWU_CONTROL_SW_RST_REQ_MASK (0x80000U)
#define AEC_AE_LPWU_CONTROL_SW_RST_REQ_SHIFT (19U)
#define AEC_AE_LPWU_CONTROL_SW_RST_REQ_WIDTH (1U)
#define AEC_AE_LPWU_CONTROL_SW_RST_REQ(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LPWU_CONTROL_SW_RST_REQ_SHIFT)) &                       \
     AEC_AE_LPWU_CONTROL_SW_RST_REQ_MASK)

#define AEC_AE_LPWU_CONTROL_NOIRQ_CFG_MASK (0x80000000U)
#define AEC_AE_LPWU_CONTROL_NOIRQ_CFG_SHIFT (31U)
#define AEC_AE_LPWU_CONTROL_NOIRQ_CFG_WIDTH (1U)
#define AEC_AE_LPWU_CONTROL_NOIRQ_CFG(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LPWU_CONTROL_NOIRQ_CFG_SHIFT)) &                        \
     AEC_AE_LPWU_CONTROL_NOIRQ_CFG_MASK)
/*! @} */

/*! @name EVENTS_STATUS - Event Notifications Status */
/*! @{ */

#define AEC_AE_EVENTS_STATUS_LIN_INT_FL_MASK (0x4U)
#define AEC_AE_EVENTS_STATUS_LIN_INT_FL_SHIFT (2U)
#define AEC_AE_EVENTS_STATUS_LIN_INT_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_LIN_INT_FL(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_LIN_INT_FL_SHIFT)) &                      \
     AEC_AE_EVENTS_STATUS_LIN_INT_FL_MASK)

#define AEC_AE_EVENTS_STATUS_OCD_VDDE_FL_MASK (0x8U)
#define AEC_AE_EVENTS_STATUS_OCD_VDDE_FL_SHIFT (3U)
#define AEC_AE_EVENTS_STATUS_OCD_VDDE_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_OCD_VDDE_FL(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_OCD_VDDE_FL_SHIFT)) &                     \
     AEC_AE_EVENTS_STATUS_OCD_VDDE_FL_MASK)

#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PMC_FL_MASK (0x10U)
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PMC_FL_SHIFT (4U)
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PMC_FL_WIDTH (1U)
#define AEC_AE_EVENTS_STATUS_TEMP_WDG_PMC_FL(x)                                                    \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_EVENTS_STATUS_TEMP_WDG_PMC_FL_SHIFT)) &                 \
     AEC_AE_EVENTS_STATUS_TEMP_WDG_PMC_FL_MASK)

