rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_FAULTS_STATUS_DPGA_OC_NEG_FL_MASK (0x4U)
#define AEC_AE_FAULTS_STATUS_DPGA_OC_NEG_FL_SHIFT (2U)
#define AEC_AE_FAULTS_STATUS_DPGA_OC_NEG_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_DPGA_OC_NEG_FL(x)                                                     \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_DPGA_OC_NEG_FL_SHIFT)) &                  \
     AEC_AE_FAULTS_STATUS_DPGA_OC_NEG_FL_MASK)

#define AEC_AE_FAULTS_STATUS_DPGA_OC_POS_FL_MASK (0x8U)
#define AEC_AE_FAULTS_STATUS_DPGA_OC_POS_FL_SHIFT (3U)
#define AEC_AE_FAULTS_STATUS_DPGA_OC_POS_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_DPGA_OC_POS_FL(x)                                                     \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_DPGA_OC_POS_FL_SHIFT)) &                  \
     AEC_AE_FAULTS_STATUS_DPGA_OC_POS_FL_MASK)

#define AEC_AE_FAULTS_STATUS_PMC_VLS_FL_MASK (0x10U)
#define AEC_AE_FAULTS_STATUS_PMC_VLS_FL_SHIFT (4U)
#define AEC_AE_FAULTS_STATUS_PMC_VLS_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_PMC_VLS_FL(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_PMC_VLS_FL_SHIFT)) &                      \
     AEC_AE_FAULTS_STATUS_PMC_VLS_FL_MASK)

#define AEC_AE_FAULTS_STATUS_RAW_FAILED_FL_MASK (0x80U)
#define AEC_AE_FAULTS_STATUS_RAW_FAILED_FL_SHIFT (7U)
#define AEC_AE_FAULTS_STATUS_RAW_FAILED_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_RAW_FAILED_FL(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_RAW_FAILED_FL_SHIFT)) &                   \
     AEC_AE_FAULTS_STATUS_RAW_FAILED_FL_MASK)

#define AEC_AE_FAULTS_STATUS_CHKSUM_ERR_FL_MASK (0x100U)
#define AEC_AE_FAULTS_STATUS_CHKSUM_ERR_FL_SHIFT (8U)
#define AEC_AE_FAULTS_STATUS_CHKSUM_ERR_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_CHKSUM_ERR_FL(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_CHKSUM_ERR_FL_SHIFT)) &                   \
     AEC_AE_FAULTS_STATUS_CHKSUM_ERR_FL_MASK)

#define AEC_AE_FAULTS_STATUS_OBSCHK_ERR_FL_MASK (0x200U)
#define AEC_AE_FAULTS_STATUS_OBSCHK_ERR_FL_SHIFT (9U)
#define AEC_AE_FAULTS_STATUS_OBSCHK_ERR_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_OBSCHK_ERR_FL(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_OBSCHK_ERR_FL_SHIFT)) &                   \
     AEC_AE_FAULTS_STATUS_OBSCHK_ERR_FL_MASK)

#define AEC_AE_FAULTS_STATUS_XFER_ERR_FL_MASK (0x400U)
#define AEC_AE_FAULTS_STATUS_XFER_ERR_FL_SHIFT (10U)
#define AEC_AE_FAULTS_STATUS_XFER_ERR_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_XFER_ERR_FL(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_XFER_ERR_FL_SHIFT)) &                     \
     AEC_AE_FAULTS_STATUS_XFER_ERR_FL_MASK)

#define AEC_AE_FAULTS_STATUS_EVENT_EXPIRED_FL_MASK (0x800U)
#define AEC_AE_FAULTS_STATUS_EVENT_EXPIRED_FL_SHIFT (11U)
#define AEC_AE_FAULTS_STATUS_EVENT_EXPIRED_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_EVENT_EXPIRED_FL(x)                                                   \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_EVENT_EXPIRED_FL_SHIFT)) &                \
     AEC_AE_FAULTS_STATUS_EVENT_EXPIRED_FL_MASK)

#define AEC_AE_FAULTS_STATUS_MCU_SUPPLY_FL_MASK (0x1000U)
#define AEC_AE_FAULTS_STATUS_MCU_SUPPLY_FL_SHIFT (12U)
#define AEC_AE_FAULTS_STATUS_MCU_SUPPLY_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_MCU_SUPPLY_FL(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_MCU_SUPPLY_FL_SHIFT)) &                   \
     AEC_AE_FAULTS_STATUS_MCU_SUPPLY_FL_MASK)

#define AEC_AE_FAULTS_STATUS_HVD_AE_INTERN_FL_MASK (0x2000U)
#define AEC_AE_FAULTS_STATUS_HVD_AE_INTERN_FL_SHIFT (13U)
#define AEC_AE_FAULTS_STATUS_HVD_AE_INTERN_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_HVD_AE_INTERN_FL(x)                                                   \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_HVD_AE_INTERN_FL_SHIFT)) &                \
     AEC_AE_FAULTS_STATUS_HVD_AE_INTERN_FL_MASK)

#define AEC_AE_FAULTS_STATUS_ILL_TEST_FL_MASK (0x4000U)
#define AEC_AE_FAULTS_STATUS_ILL_TEST_FL_SHIFT (14U)
#define AEC_AE_FAULTS_STATUS_ILL_TEST_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_ILL_TEST_FL(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_ILL_TEST_FL_SHIFT)) &                     \
     AEC_AE_FAULTS_STATUS_ILL_TEST_FL_MASK)

#define AEC_AE_FAULTS_STATUS_ALIVE_WDG_FL_MASK (0x8000U)
#define AEC_AE_FAULTS_STATUS_ALIVE_WDG_FL_SHIFT (15U)
#define AEC_AE_FAULTS_STATUS_ALIVE_WDG_FL_WIDTH (1U)
#define AEC_AE_FAULTS_STATUS_ALIVE_WDG_FL(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_STATUS_ALIVE_WDG_FL_SHIFT)) &                    \
     AEC_AE_FAULTS_STATUS_ALIVE_WDG_FL_MASK)
/*! @} */

/*! @name FAULTS_ENABLE - Fault Notifications Enable */
/*! @{ */

#define AEC_AE_FAULTS_ENABLE_GDU_FAULT_PROT_EN_MASK (0x1U)
#define AEC_AE_FAULTS_ENABLE_GDU_FAULT_PROT_EN_SHIFT (0U)
#define AEC_AE_FAULTS_ENABLE_GDU_FAULT_PROT_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_GDU_FAULT_PROT_EN(x)                                                  \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_GDU_FAULT_PROT_EN_SHIFT)) &               \
     AEC_AE_FAULTS_ENABLE_GDU_FAULT_PROT_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_GDU_INT_EN_MASK (0x2U)
#define AEC_AE_FAULTS_ENABLE_GDU_INT_EN_SHIFT (1U)
#define AEC_AE_FAULTS_ENABLE_GDU_INT_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_GDU_INT_EN(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_GDU_INT_EN_SHIFT)) &                      \
     AEC_AE_FAULTS_ENABLE_GDU_INT_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_DPGA_OC_NEG_EN_MASK (0x4U)
#define AEC_AE_FAULTS_ENABLE_DPGA_OC_NEG_EN_SHIFT (2U)
#define AEC_AE_FAULTS_ENABLE_DPGA_OC_NEG_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_DPGA_OC_NEG_EN(x)                                                     \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_DPGA_OC_NEG_EN_SHIFT)) &                  \
     AEC_AE_FAULTS_ENABLE_DPGA_OC_NEG_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_DPGA_OC_POS_EN_MASK (0x8U)
#define AEC_AE_FAULTS_ENABLE_DPGA_OC_POS_EN_SHIFT (3U)
#define AEC_AE_FAULTS_ENABLE_DPGA_OC_POS_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_DPGA_OC_POS_EN(x)                                                     \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_DPGA_OC_POS_EN_SHIFT)) &                  \
     AEC_AE_FAULTS_ENABLE_DPGA_OC_POS_EN_MASK)

