rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_FAULTS_ENABLE_PMC_VLS_EN_MASK (0x10U)
#define AEC_AE_FAULTS_ENABLE_PMC_VLS_EN_SHIFT (4U)
#define AEC_AE_FAULTS_ENABLE_PMC_VLS_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_PMC_VLS_EN(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_PMC_VLS_EN_SHIFT)) &                      \
     AEC_AE_FAULTS_ENABLE_PMC_VLS_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_RAW_FAILED_EN_MASK (0x80U)
#define AEC_AE_FAULTS_ENABLE_RAW_FAILED_EN_SHIFT (7U)
#define AEC_AE_FAULTS_ENABLE_RAW_FAILED_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_RAW_FAILED_EN(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_RAW_FAILED_EN_SHIFT)) &                   \
     AEC_AE_FAULTS_ENABLE_RAW_FAILED_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_CHKSUM_ERR_EN_MASK (0x100U)
#define AEC_AE_FAULTS_ENABLE_CHKSUM_ERR_EN_SHIFT (8U)
#define AEC_AE_FAULTS_ENABLE_CHKSUM_ERR_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_CHKSUM_ERR_EN(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_CHKSUM_ERR_EN_SHIFT)) &                   \
     AEC_AE_FAULTS_ENABLE_CHKSUM_ERR_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_OBSCHK_ERR_EN_MASK (0x200U)
#define AEC_AE_FAULTS_ENABLE_OBSCHK_ERR_EN_SHIFT (9U)
#define AEC_AE_FAULTS_ENABLE_OBSCHK_ERR_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_OBSCHK_ERR_EN(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_OBSCHK_ERR_EN_SHIFT)) &                   \
     AEC_AE_FAULTS_ENABLE_OBSCHK_ERR_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_XFER_ERR_EN_MASK (0x400U)
#define AEC_AE_FAULTS_ENABLE_XFER_ERR_EN_SHIFT (10U)
#define AEC_AE_FAULTS_ENABLE_XFER_ERR_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_XFER_ERR_EN(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_XFER_ERR_EN_SHIFT)) &                     \
     AEC_AE_FAULTS_ENABLE_XFER_ERR_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_EVENT_EXPIRED_EN_MASK (0x800U)
#define AEC_AE_FAULTS_ENABLE_EVENT_EXPIRED_EN_SHIFT (11U)
#define AEC_AE_FAULTS_ENABLE_EVENT_EXPIRED_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_EVENT_EXPIRED_EN(x)                                                   \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_EVENT_EXPIRED_EN_SHIFT)) &                \
     AEC_AE_FAULTS_ENABLE_EVENT_EXPIRED_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_MCU_SUPPLY_EN_MASK (0x1000U)
#define AEC_AE_FAULTS_ENABLE_MCU_SUPPLY_EN_SHIFT (12U)
#define AEC_AE_FAULTS_ENABLE_MCU_SUPPLY_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_MCU_SUPPLY_EN(x)                                                      \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_MCU_SUPPLY_EN_SHIFT)) &                   \
     AEC_AE_FAULTS_ENABLE_MCU_SUPPLY_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_HVD_AE_INTERN_EN_MASK (0x2000U)
#define AEC_AE_FAULTS_ENABLE_HVD_AE_INTERN_EN_SHIFT (13U)
#define AEC_AE_FAULTS_ENABLE_HVD_AE_INTERN_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_HVD_AE_INTERN_EN(x)                                                   \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_HVD_AE_INTERN_EN_SHIFT)) &                \
     AEC_AE_FAULTS_ENABLE_HVD_AE_INTERN_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_ILL_TEST_EN_MASK (0x4000U)
#define AEC_AE_FAULTS_ENABLE_ILL_TEST_EN_SHIFT (14U)
#define AEC_AE_FAULTS_ENABLE_ILL_TEST_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_ILL_TEST_EN(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_ILL_TEST_EN_SHIFT)) &                     \
     AEC_AE_FAULTS_ENABLE_ILL_TEST_EN_MASK)

#define AEC_AE_FAULTS_ENABLE_ALIVE_WDG_EN_MASK (0x8000U)
#define AEC_AE_FAULTS_ENABLE_ALIVE_WDG_EN_SHIFT (15U)
#define AEC_AE_FAULTS_ENABLE_ALIVE_WDG_EN_WIDTH (1U)
#define AEC_AE_FAULTS_ENABLE_ALIVE_WDG_EN(x)                                                       \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULTS_ENABLE_ALIVE_WDG_EN_SHIFT)) &                    \
     AEC_AE_FAULTS_ENABLE_ALIVE_WDG_EN_MASK)
/*! @} */

/*! @name NOTIFS_MONITOR - Monitoring of Notifications */
/*! @{ */

#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_VAL_MASK (0x1U)
#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_VAL_SHIFT (0U)
#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_VAL_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_VAL(x)                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_VAL_SHIFT)) &           \
     AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_VAL_MASK)

#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_ERR_MASK (0x2U)
#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_ERR_SHIFT (1U)
#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_ERR(x)                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_ERR_SHIFT)) &           \
     AEC_AE_NOTIFS_MONITOR_ALIVE_WD_CFG_PAR_ERR_MASK)

#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_VAL_MASK (0x4U)
#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_VAL_SHIFT (2U)
#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_VAL_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_VAL(x)                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_VAL_SHIFT)) &           \
     AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_VAL_MASK)

#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_ERR_MASK (0x8U)
#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_ERR_SHIFT (3U)
#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_ERR(x)                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_ERR_SHIFT)) &           \
     AEC_AE_NOTIFS_MONITOR_FAULT_WD_CFG_PAR_ERR_MASK)

#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_VAL_MASK (0x10U)
#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_VAL_SHIFT (4U)
#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_VAL_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_VAL(x)                                                \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_VAL_SHIFT)) &             \
     AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_VAL_MASK)

#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_ERR_MASK (0x20U)
#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_ERR_SHIFT (5U)
#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_ERR(x)                                                \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_ERR_SHIFT)) &             \
     AEC_AE_NOTIFS_MONITOR_EVENTS_ENA_PAR_ERR_MASK)

#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_VAL_MASK (0x40U)
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_VAL_SHIFT (6U)
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_VAL_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_VAL(x)                                                \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_VAL_SHIFT)) &             \
     AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_VAL_MASK)

