rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN_MASK (0x10U)
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN_SHIFT (4U)
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT04_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT04_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT04_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT05_EN_MASK (0x20U)
#define AEC_AE_SAFETY_ENABLE_EVENT05_EN_SHIFT (5U)
#define AEC_AE_SAFETY_ENABLE_EVENT05_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT05_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT05_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT05_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT06_EN_MASK (0x40U)
#define AEC_AE_SAFETY_ENABLE_EVENT06_EN_SHIFT (6U)
#define AEC_AE_SAFETY_ENABLE_EVENT06_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT06_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT06_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT06_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT07_EN_MASK (0x80U)
#define AEC_AE_SAFETY_ENABLE_EVENT07_EN_SHIFT (7U)
#define AEC_AE_SAFETY_ENABLE_EVENT07_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT07_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT07_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT07_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT08_EN_MASK (0x100U)
#define AEC_AE_SAFETY_ENABLE_EVENT08_EN_SHIFT (8U)
#define AEC_AE_SAFETY_ENABLE_EVENT08_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT08_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT08_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT08_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT09_EN_MASK (0x200U)
#define AEC_AE_SAFETY_ENABLE_EVENT09_EN_SHIFT (9U)
#define AEC_AE_SAFETY_ENABLE_EVENT09_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT09_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT09_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT09_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT10_EN_MASK (0x400U)
#define AEC_AE_SAFETY_ENABLE_EVENT10_EN_SHIFT (10U)
#define AEC_AE_SAFETY_ENABLE_EVENT10_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT10_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT10_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT10_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT11_EN_MASK (0x800U)
#define AEC_AE_SAFETY_ENABLE_EVENT11_EN_SHIFT (11U)
#define AEC_AE_SAFETY_ENABLE_EVENT11_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT11_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT11_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT11_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT12_EN_MASK (0x1000U)
#define AEC_AE_SAFETY_ENABLE_EVENT12_EN_SHIFT (12U)
#define AEC_AE_SAFETY_ENABLE_EVENT12_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT12_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT12_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT12_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT13_EN_MASK (0x2000U)
#define AEC_AE_SAFETY_ENABLE_EVENT13_EN_SHIFT (13U)
#define AEC_AE_SAFETY_ENABLE_EVENT13_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT13_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT13_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT13_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT14_EN_MASK (0x4000U)
#define AEC_AE_SAFETY_ENABLE_EVENT14_EN_SHIFT (14U)
#define AEC_AE_SAFETY_ENABLE_EVENT14_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT14_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT14_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT14_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_EVENT15_EN_MASK (0x8000U)
#define AEC_AE_SAFETY_ENABLE_EVENT15_EN_SHIFT (15U)
#define AEC_AE_SAFETY_ENABLE_EVENT15_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_EVENT15_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_EVENT15_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_EVENT15_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT00_EN_MASK (0x10000U)
#define AEC_AE_SAFETY_ENABLE_FAULT00_EN_SHIFT (16U)
#define AEC_AE_SAFETY_ENABLE_FAULT00_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT00_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT00_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT00_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT01_EN_MASK (0x20000U)
#define AEC_AE_SAFETY_ENABLE_FAULT01_EN_SHIFT (17U)
#define AEC_AE_SAFETY_ENABLE_FAULT01_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT01_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT01_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT01_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT02_EN_MASK (0x40000U)
#define AEC_AE_SAFETY_ENABLE_FAULT02_EN_SHIFT (18U)
#define AEC_AE_SAFETY_ENABLE_FAULT02_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT02_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT02_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT02_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT03_EN_MASK (0x80000U)
#define AEC_AE_SAFETY_ENABLE_FAULT03_EN_SHIFT (19U)
#define AEC_AE_SAFETY_ENABLE_FAULT03_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT03_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT03_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT03_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT04_EN_MASK (0x100000U)
#define AEC_AE_SAFETY_ENABLE_FAULT04_EN_SHIFT (20U)
#define AEC_AE_SAFETY_ENABLE_FAULT04_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT04_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT04_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT04_EN_MASK)

