rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_SAFETY_ENABLE_FAULT05_EN_MASK (0x200000U)
#define AEC_AE_SAFETY_ENABLE_FAULT05_EN_SHIFT (21U)
#define AEC_AE_SAFETY_ENABLE_FAULT05_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT05_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT05_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT05_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT06_EN_MASK (0x400000U)
#define AEC_AE_SAFETY_ENABLE_FAULT06_EN_SHIFT (22U)
#define AEC_AE_SAFETY_ENABLE_FAULT06_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT06_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT06_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT06_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT07_EN_MASK (0x800000U)
#define AEC_AE_SAFETY_ENABLE_FAULT07_EN_SHIFT (23U)
#define AEC_AE_SAFETY_ENABLE_FAULT07_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT07_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT07_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT07_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT08_EN_MASK (0x1000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT08_EN_SHIFT (24U)
#define AEC_AE_SAFETY_ENABLE_FAULT08_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT08_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT08_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT08_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT09_EN_MASK (0x2000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT09_EN_SHIFT (25U)
#define AEC_AE_SAFETY_ENABLE_FAULT09_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT09_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT09_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT09_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT10_EN_MASK (0x4000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT10_EN_SHIFT (26U)
#define AEC_AE_SAFETY_ENABLE_FAULT10_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT10_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT10_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT10_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT11_EN_MASK (0x8000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT11_EN_SHIFT (27U)
#define AEC_AE_SAFETY_ENABLE_FAULT11_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT11_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT11_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT11_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT12_EN_MASK (0x10000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT12_EN_SHIFT (28U)
#define AEC_AE_SAFETY_ENABLE_FAULT12_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT12_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT12_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT12_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT13_EN_MASK (0x20000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT13_EN_SHIFT (29U)
#define AEC_AE_SAFETY_ENABLE_FAULT13_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT13_EN(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT13_EN_SHIFT)) &                      \
     AEC_AE_SAFETY_ENABLE_FAULT13_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT_ILL_TEST_EN_MASK (0x40000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT_ILL_TEST_EN_SHIFT (30U)
#define AEC_AE_SAFETY_ENABLE_FAULT_ILL_TEST_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT_ILL_TEST_EN(x)                                                  \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT_ILL_TEST_EN_SHIFT)) &               \
     AEC_AE_SAFETY_ENABLE_FAULT_ILL_TEST_EN_MASK)

#define AEC_AE_SAFETY_ENABLE_FAULT_ALIVE_WDG_EN_MASK (0x80000000U)
#define AEC_AE_SAFETY_ENABLE_FAULT_ALIVE_WDG_EN_SHIFT (31U)
#define AEC_AE_SAFETY_ENABLE_FAULT_ALIVE_WDG_EN_WIDTH (1U)
#define AEC_AE_SAFETY_ENABLE_FAULT_ALIVE_WDG_EN(x)                                                 \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_SAFETY_ENABLE_FAULT_ALIVE_WDG_EN_SHIFT)) &              \
     AEC_AE_SAFETY_ENABLE_FAULT_ALIVE_WDG_EN_MASK)
/*! @} */

/*! @name SYSCLK_CHECK - System Clock Check */
/*! @{ */

#define AEC_AE_SYSCLK_CHECK_VALID_THR_L_MASK (0x7FU)
#define AEC_AE_SYSCLK_CHECK_VALID_THR_L_SHIFT (0U)
#define AEC_AE_SYSCLK_CHECK_VALID_THR_L_WIDTH (7U)
#define AEC_AE_SYSCLK_CHECK_VALID_THR_L(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_SYSCLK_CHECK_VALID_THR_L_SHIFT)) &                      \
     AEC_AE_SYSCLK_CHECK_VALID_THR_L_MASK)

#define AEC_AE_SYSCLK_CHECK_VALID_THR_U_MASK (0xFF80U)
#define AEC_AE_SYSCLK_CHECK_VALID_THR_U_SHIFT (7U)
#define AEC_AE_SYSCLK_CHECK_VALID_THR_U_WIDTH (9U)
#define AEC_AE_SYSCLK_CHECK_VALID_THR_U(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_SYSCLK_CHECK_VALID_THR_U_SHIFT)) &                      \
     AEC_AE_SYSCLK_CHECK_VALID_THR_U_MASK)
/*! @} */

/*! @name ALIVE_WD_CFG - Alive Watchdog Configuration */
/*! @{ */

#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_MASK (0xFU)
#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_SHIFT (0U)
#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_WIDTH (4U)
#define AEC_AE_ALIVE_WD_CFG_WDW_PERIOD(x)                                                          \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_SHIFT)) &                       \
     AEC_AE_ALIVE_WD_CFG_WDW_PERIOD_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_DC_MASK (0xC0U)
#define AEC_AE_ALIVE_WD_CFG_WDW_DC_SHIFT (6U)
#define AEC_AE_ALIVE_WD_CFG_WDW_DC_WIDTH (2U)
#define AEC_AE_ALIVE_WD_CFG_WDW_DC(x)                                                              \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_DC_SHIFT)) &                           \
     AEC_AE_ALIVE_WD_CFG_WDW_DC_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_MASK (0x300U)
#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_SHIFT (8U)
#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_WIDTH (2U)
#define AEC_AE_ALIVE_WD_CFG_WDW_BADRESP(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_SHIFT)) &                      \
     AEC_AE_ALIVE_WD_CFG_WDW_BADRESP_MASK)

