rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE_MASK (0x4000U)
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE_SHIFT (14U)
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE_WIDTH (1U)
#define AEC_AE_ALIVE_WD_CFG_WDW_MODE(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_MODE_SHIFT)) &                         \
     AEC_AE_ALIVE_WD_CFG_WDW_MODE_MASK)

#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_MASK (0x8000U)
#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_SHIFT (15U)
#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_WIDTH (1U)
#define AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_SHIFT)) &                     \
     AEC_AE_ALIVE_WD_CFG_WDW_FAULTREC_MASK)
/*! @} */

/*! @name ALIVE_WD_TOKEN - Alive Watchdog Reference Value */
/*! @{ */

#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_MASK (0xFFFFU)
#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_SHIFT (0U)
#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_WIDTH (16U)
#define AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN(x)                                                          \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_SHIFT)) &                       \
     AEC_AE_ALIVE_WD_TOKEN_WD_TOKEN_MASK)
/*! @} */

/*! @name ALIVE_WD_ANSWER - Alive Watchdog Answer */
/*! @{ */

#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_MASK (0xFFFFU)
#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_SHIFT (0U)
#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_WIDTH (16U)
#define AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_SHIFT)) &                     \
     AEC_AE_ALIVE_WD_ANSWER_WD_ANSWER_MASK)
/*! @} */

/*! @name FAULT_WD_CFG - Fault Watchdog Configuration */
/*! @{ */

#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_MASK (0xFFFU)
#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_SHIFT (0U)
#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_WIDTH (12U)
#define AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_SHIFT)) &                     \
     AEC_AE_FAULT_WD_CFG_TIME_OUT_CFG_MASK)
/*! @} */

/*! @name CLKGEN_CFG - Clock Generator Configuration */
/*! @{ */

#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG_MASK (0xFFU)
#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG_SHIFT (0U)
#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG_WIDTH (8U)
#define AEC_AE_CLKGEN_CFG_CLKGEN_CFG(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_CLKGEN_CFG_SHIFT)) &                         \
     AEC_AE_CLKGEN_CFG_CLKGEN_CFG_MASK)

#define AEC_AE_CLKGEN_CFG_CXPI_CLK_EN_MASK (0x100U)
#define AEC_AE_CLKGEN_CFG_CXPI_CLK_EN_SHIFT (8U)
#define AEC_AE_CLKGEN_CFG_CXPI_CLK_EN_WIDTH (1U)
#define AEC_AE_CLKGEN_CFG_CXPI_CLK_EN(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_CXPI_CLK_EN_SHIFT)) &                        \
     AEC_AE_CLKGEN_CFG_CXPI_CLK_EN_MASK)

#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_ENA_MASK (0x400U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_ENA_SHIFT (10U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_ENA_WIDTH (1U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_ENA(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_RCOSC_MOD_ENA_SHIFT)) &                      \
     AEC_AE_CLKGEN_CFG_RCOSC_MOD_ENA_MASK)

#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_FRQ_MASK (0x3800U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_FRQ_SHIFT (11U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_FRQ_WIDTH (3U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_FRQ(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_RCOSC_MOD_FRQ_SHIFT)) &                      \
     AEC_AE_CLKGEN_CFG_RCOSC_MOD_FRQ_MASK)

#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_NBR_MASK (0xC000U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_NBR_SHIFT (14U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_NBR_WIDTH (2U)
#define AEC_AE_CLKGEN_CFG_RCOSC_MOD_NBR(x)                                                         \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_RCOSC_MOD_NBR_SHIFT)) &                      \
     AEC_AE_CLKGEN_CFG_RCOSC_MOD_NBR_MASK)

#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_MASK (0x1FF0000U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_SHIFT (16U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_WIDTH (9U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_SHIFT)) &                    \
     AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_VAL_MASK)

#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_MASK (0x10000000U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_SHIFT (28U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_WIDTH (1U)
#define AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_SHIFT)) &                    \
     AEC_AE_CLKGEN_CFG_SYSCLK_FREQ_CFG_MASK)
/*! @} */

/*! @name RSTGEN_CFG - Reset Generator Configuration */
/*! @{ */

#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG_MASK (0x1FFU)
#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG_SHIFT (0U)
#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG_WIDTH (9U)
#define AEC_AE_RSTGEN_CFG_RSTGEN_CFG(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_RSTGEN_CFG_RSTGEN_CFG_SHIFT)) &                         \
     AEC_AE_RSTGEN_CFG_RSTGEN_CFG_MASK)

#define AEC_AE_RSTGEN_CFG_NOFLUSH_MASK (0x8000U)
#define AEC_AE_RSTGEN_CFG_NOFLUSH_SHIFT (15U)
#define AEC_AE_RSTGEN_CFG_NOFLUSH_WIDTH (1U)
#define AEC_AE_RSTGEN_CFG_NOFLUSH(x)                                                               \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_RSTGEN_CFG_NOFLUSH_SHIFT)) &                            \
     AEC_AE_RSTGEN_CFG_NOFLUSH_MASK)
/*! @} */

/*! @name IO_FUNCMUX_CFG - IO Funcmux Configuration */
/*! @{ */

