rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_MASK (0x1U)
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_SHIFT (0U)
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_WIDTH (1U)
#define AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_SHIFT)) &                       \
     AEC_AE_IO_FUNCMUX_CFG_DPGA_OUT_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_MASK (0xEU)
#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_SHIFT (1U)
#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_WIDTH (3U)
#define AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL(x)                                                        \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_SHIFT)) &                     \
     AEC_AE_IO_FUNCMUX_CFG_AMPOUT_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_MASK (0x100U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_SHIFT (8U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_WIDTH (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_SHIFT)) &                       \
     AEC_AE_IO_FUNCMUX_CFG_VDDE_DRV_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_MASK (0x200U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_SHIFT (9U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_WIDTH (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_SHIFT)) &                       \
     AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_MASK (0xC00U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_SHIFT (10U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_WIDTH (2U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_SHIFT)) &                        \
     AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_MASK (0x1000U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_SHIFT (12U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_WIDTH (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_SHIFT)) &                    \
     AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_MASK (0x10000U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_SHIFT (16U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_WIDTH (1U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_D2D_EN_SHIFT)) &                         \
     AEC_AE_IO_FUNCMUX_CFG_D2D_EN_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_MASK (0x20000U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_SHIFT (17U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_WIDTH (1U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_OUTSEL_SHIFT)) &                         \
     AEC_AE_IO_FUNCMUX_CFG_OUTSEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_MASK (0xC0000U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_SHIFT (18U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_WIDTH (2U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_CLKSEL_SHIFT)) &                         \
     AEC_AE_IO_FUNCMUX_CFG_CLKSEL_MASK)
/*! @} */

/*! @name LINPHY_CFG - LINPHY Configuration */
/*! @{ */

#define AEC_AE_LINPHY_CFG_MODE_MASK (0x3U)
#define AEC_AE_LINPHY_CFG_MODE_SHIFT (0U)
#define AEC_AE_LINPHY_CFG_MODE_WIDTH (2U)
#define AEC_AE_LINPHY_CFG_MODE(x)                                                                  \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_MODE_SHIFT)) & AEC_AE_LINPHY_CFG_MODE_MASK)

#define AEC_AE_LINPHY_CFG_ENAWUP_MASK (0x4U)
#define AEC_AE_LINPHY_CFG_ENAWUP_SHIFT (2U)
#define AEC_AE_LINPHY_CFG_ENAWUP_WIDTH (1U)
#define AEC_AE_LINPHY_CFG_ENAWUP(x)                                                                \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_ENAWUP_SHIFT)) &                             \
     AEC_AE_LINPHY_CFG_ENAWUP_MASK)

#define AEC_AE_LINPHY_CFG_ENATXTO_MASK (0x8U)
#define AEC_AE_LINPHY_CFG_ENATXTO_SHIFT (3U)
#define AEC_AE_LINPHY_CFG_ENATXTO_WIDTH (1U)
#define AEC_AE_LINPHY_CFG_ENATXTO(x)                                                               \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_ENATXTO_SHIFT)) &                            \
     AEC_AE_LINPHY_CFG_ENATXTO_MASK)

#define AEC_AE_LINPHY_CFG_SLEW_MASK (0x30U)
#define AEC_AE_LINPHY_CFG_SLEW_SHIFT (4U)
#define AEC_AE_LINPHY_CFG_SLEW_WIDTH (2U)
#define AEC_AE_LINPHY_CFG_SLEW(x)                                                                  \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_SLEW_SHIFT)) & AEC_AE_LINPHY_CFG_SLEW_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_NSLP_MASK (0x100U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP_SHIFT (8U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP_WIDTH (1U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP(x)                                                             \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_NSLP_SHIFT)) &                          \
     AEC_AE_LINPHY_CFG_CXPI_NSLP_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_MS_MASK (0x200U)
#define AEC_AE_LINPHY_CFG_CXPI_MS_SHIFT (9U)
#define AEC_AE_LINPHY_CFG_CXPI_MS_WIDTH (1U)
#define AEC_AE_LINPHY_CFG_CXPI_MS(x)                                                               \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_MS_SHIFT)) &                            \
     AEC_AE_LINPHY_CFG_CXPI_MS_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_SLOPE_MASK (0x400U)
#define AEC_AE_LINPHY_CFG_CXPI_SLOPE_SHIFT (10U)
#define AEC_AE_LINPHY_CFG_CXPI_SLOPE_WIDTH (1U)
#define AEC_AE_LINPHY_CFG_CXPI_SLOPE(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_SLOPE_SHIFT)) &                         \
     AEC_AE_LINPHY_CFG_CXPI_SLOPE_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_BOOST_MASK (0x800U)
#define AEC_AE_LINPHY_CFG_CXPI_BOOST_SHIFT (11U)
#define AEC_AE_LINPHY_CFG_CXPI_BOOST_WIDTH (1U)
#define AEC_AE_LINPHY_CFG_CXPI_BOOST(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_BOOST_SHIFT)) &                         \
     AEC_AE_LINPHY_CFG_CXPI_BOOST_MASK)

