rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_TMON_PHY_PHY_150_FL_MASK (0x4U)
#define AEC_AE_TMON_PHY_PHY_150_FL_SHIFT (2U)
#define AEC_AE_TMON_PHY_PHY_150_FL_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_150_FL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_150_FL_SHIFT)) &                           \
     AEC_AE_TMON_PHY_PHY_150_FL_MASK)

#define AEC_AE_TMON_PHY_PHY_175_FL_MASK (0x8U)
#define AEC_AE_TMON_PHY_PHY_175_FL_SHIFT (3U)
#define AEC_AE_TMON_PHY_PHY_175_FL_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_175_FL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_175_FL_SHIFT)) &                           \
     AEC_AE_TMON_PHY_PHY_175_FL_MASK)

#define AEC_AE_TMON_PHY_PHY_85_MON_MASK (0x100U)
#define AEC_AE_TMON_PHY_PHY_85_MON_SHIFT (8U)
#define AEC_AE_TMON_PHY_PHY_85_MON_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_85_MON(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_85_MON_SHIFT)) &                           \
     AEC_AE_TMON_PHY_PHY_85_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_125_MON_MASK (0x200U)
#define AEC_AE_TMON_PHY_PHY_125_MON_SHIFT (9U)
#define AEC_AE_TMON_PHY_PHY_125_MON_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_125_MON(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_125_MON_SHIFT)) &                          \
     AEC_AE_TMON_PHY_PHY_125_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_150_MON_MASK (0x400U)
#define AEC_AE_TMON_PHY_PHY_150_MON_SHIFT (10U)
#define AEC_AE_TMON_PHY_PHY_150_MON_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_150_MON(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_150_MON_SHIFT)) &                          \
     AEC_AE_TMON_PHY_PHY_150_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_175_MON_MASK (0x800U)
#define AEC_AE_TMON_PHY_PHY_175_MON_SHIFT (11U)
#define AEC_AE_TMON_PHY_PHY_175_MON_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_175_MON(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_175_MON_SHIFT)) &                          \
     AEC_AE_TMON_PHY_PHY_175_MON_MASK)

#define AEC_AE_TMON_PHY_PHY_85_EN_MASK (0x10000U)
#define AEC_AE_TMON_PHY_PHY_85_EN_SHIFT (16U)
#define AEC_AE_TMON_PHY_PHY_85_EN_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_85_EN(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_85_EN_SHIFT)) &                            \
     AEC_AE_TMON_PHY_PHY_85_EN_MASK)

#define AEC_AE_TMON_PHY_PHY_125_EN_MASK (0x20000U)
#define AEC_AE_TMON_PHY_PHY_125_EN_SHIFT (17U)
#define AEC_AE_TMON_PHY_PHY_125_EN_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_125_EN(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_125_EN_SHIFT)) &                           \
     AEC_AE_TMON_PHY_PHY_125_EN_MASK)

#define AEC_AE_TMON_PHY_PHY_150_EN_MASK (0x40000U)
#define AEC_AE_TMON_PHY_PHY_150_EN_SHIFT (18U)
#define AEC_AE_TMON_PHY_PHY_150_EN_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_150_EN(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_150_EN_SHIFT)) &                           \
     AEC_AE_TMON_PHY_PHY_150_EN_MASK)

#define AEC_AE_TMON_PHY_PHY_175_EN_MASK (0x80000U)
#define AEC_AE_TMON_PHY_PHY_175_EN_SHIFT (19U)
#define AEC_AE_TMON_PHY_PHY_175_EN_WIDTH (1U)
#define AEC_AE_TMON_PHY_PHY_175_EN(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PHY_PHY_175_EN_SHIFT)) &                           \
     AEC_AE_TMON_PHY_PHY_175_EN_MASK)
/*! @} */

/*! @name TMON_PMC - Temperature Monitor PMC */
/*! @{ */

#define AEC_AE_TMON_PMC_PMC_85_FL_MASK (0x1U)
#define AEC_AE_TMON_PMC_PMC_85_FL_SHIFT (0U)
#define AEC_AE_TMON_PMC_PMC_85_FL_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_85_FL(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_85_FL_SHIFT)) &                            \
     AEC_AE_TMON_PMC_PMC_85_FL_MASK)

#define AEC_AE_TMON_PMC_PMC_125_FL_MASK (0x2U)
#define AEC_AE_TMON_PMC_PMC_125_FL_SHIFT (1U)
#define AEC_AE_TMON_PMC_PMC_125_FL_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_125_FL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_125_FL_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_125_FL_MASK)

#define AEC_AE_TMON_PMC_PMC_150_FL_MASK (0x4U)
#define AEC_AE_TMON_PMC_PMC_150_FL_SHIFT (2U)
#define AEC_AE_TMON_PMC_PMC_150_FL_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_150_FL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_150_FL_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_150_FL_MASK)

#define AEC_AE_TMON_PMC_PMC_175_FL_MASK (0x8U)
#define AEC_AE_TMON_PMC_PMC_175_FL_SHIFT (3U)
#define AEC_AE_TMON_PMC_PMC_175_FL_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_175_FL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_175_FL_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_175_FL_MASK)

#define AEC_AE_TMON_PMC_PMC_85_MON_MASK (0x100U)
#define AEC_AE_TMON_PMC_PMC_85_MON_SHIFT (8U)
#define AEC_AE_TMON_PMC_PMC_85_MON_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_85_MON(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_85_MON_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_85_MON_MASK)

#define AEC_AE_TMON_PMC_PMC_125_MON_MASK (0x200U)
#define AEC_AE_TMON_PMC_PMC_125_MON_SHIFT (9U)
#define AEC_AE_TMON_PMC_PMC_125_MON_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_125_MON(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_125_MON_SHIFT)) &                          \
     AEC_AE_TMON_PMC_PMC_125_MON_MASK)

#define AEC_AE_TMON_PMC_PMC_150_MON_MASK (0x400U)
#define AEC_AE_TMON_PMC_PMC_150_MON_SHIFT (10U)
#define AEC_AE_TMON_PMC_PMC_150_MON_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_150_MON(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_150_MON_SHIFT)) &                          \
     AEC_AE_TMON_PMC_PMC_150_MON_MASK)

