rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_AEC_AE.h
#define AEC_AE_TMON_PMC_PMC_175_MON_MASK (0x800U)
#define AEC_AE_TMON_PMC_PMC_175_MON_SHIFT (11U)
#define AEC_AE_TMON_PMC_PMC_175_MON_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_175_MON(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_175_MON_SHIFT)) &                          \
     AEC_AE_TMON_PMC_PMC_175_MON_MASK)

#define AEC_AE_TMON_PMC_PMC_85_EN_MASK (0x10000U)
#define AEC_AE_TMON_PMC_PMC_85_EN_SHIFT (16U)
#define AEC_AE_TMON_PMC_PMC_85_EN_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_85_EN(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_85_EN_SHIFT)) &                            \
     AEC_AE_TMON_PMC_PMC_85_EN_MASK)

#define AEC_AE_TMON_PMC_PMC_125_EN_MASK (0x20000U)
#define AEC_AE_TMON_PMC_PMC_125_EN_SHIFT (17U)
#define AEC_AE_TMON_PMC_PMC_125_EN_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_125_EN(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_125_EN_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_125_EN_MASK)

#define AEC_AE_TMON_PMC_PMC_150_EN_MASK (0x40000U)
#define AEC_AE_TMON_PMC_PMC_150_EN_SHIFT (18U)
#define AEC_AE_TMON_PMC_PMC_150_EN_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_150_EN(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_150_EN_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_150_EN_MASK)

#define AEC_AE_TMON_PMC_PMC_175_EN_MASK (0x80000U)
#define AEC_AE_TMON_PMC_PMC_175_EN_SHIFT (19U)
#define AEC_AE_TMON_PMC_PMC_175_EN_WIDTH (1U)
#define AEC_AE_TMON_PMC_PMC_175_EN(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << AEC_AE_TMON_PMC_PMC_175_EN_SHIFT)) &                           \
     AEC_AE_TMON_PMC_PMC_175_EN_MASK)
/*! @} */

/*! @name TMON_MONITOR - TMON Monitor */
/*! @{ */

#define AEC_AE_TMON_MONITOR_PHY_SELF_FL_MASK (0x1U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_FL_SHIFT (0U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_FL_WIDTH (1U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_FL(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_MONITOR_PHY_SELF_FL_SHIFT)) &                      \
     AEC_AE_TMON_MONITOR_PHY_SELF_FL_MASK)

#define AEC_AE_TMON_MONITOR_PHY_SELF_MON_MASK (0x2U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_MON_SHIFT (1U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_MON_WIDTH (1U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_MON(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_MONITOR_PHY_SELF_MON_SHIFT)) &                     \
     AEC_AE_TMON_MONITOR_PHY_SELF_MON_MASK)

#define AEC_AE_TMON_MONITOR_PHY_SELF_EN_MASK (0x10U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_EN_SHIFT (4U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_EN_WIDTH (1U)
#define AEC_AE_TMON_MONITOR_PHY_SELF_EN(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_MONITOR_PHY_SELF_EN_SHIFT)) &                      \
     AEC_AE_TMON_MONITOR_PHY_SELF_EN_MASK)

#define AEC_AE_TMON_MONITOR_PMC_SELF_FL_MASK (0x100U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_FL_SHIFT (8U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_FL_WIDTH (1U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_FL(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_MONITOR_PMC_SELF_FL_SHIFT)) &                      \
     AEC_AE_TMON_MONITOR_PMC_SELF_FL_MASK)

#define AEC_AE_TMON_MONITOR_PMC_SELF_MON_MASK (0x200U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_MON_SHIFT (9U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_MON_WIDTH (1U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_MON(x)                                                        \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_MONITOR_PMC_SELF_MON_SHIFT)) &                     \
     AEC_AE_TMON_MONITOR_PMC_SELF_MON_MASK)

#define AEC_AE_TMON_MONITOR_PMC_SELF_EN_MASK (0x1000U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_EN_SHIFT (12U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_EN_WIDTH (1U)
#define AEC_AE_TMON_MONITOR_PMC_SELF_EN(x)                                                         \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_MONITOR_PMC_SELF_EN_SHIFT)) &                      \
     AEC_AE_TMON_MONITOR_PMC_SELF_EN_MASK)
/*! @} */

/*! @name TMON_CHECK - TMON Check */
/*! @{ */

#define AEC_AE_TMON_CHECK_SELF_CMD_MASK (0x1U)
#define AEC_AE_TMON_CHECK_SELF_CMD_SHIFT (0U)
#define AEC_AE_TMON_CHECK_SELF_CMD_WIDTH (1U)
#define AEC_AE_TMON_CHECK_SELF_CMD(x)                                                              \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_CHECK_SELF_CMD_SHIFT)) &                           \
     AEC_AE_TMON_CHECK_SELF_CMD_MASK)

#define AEC_AE_TMON_CHECK_SELF_ACT_MASK (0x2U)
#define AEC_AE_TMON_CHECK_SELF_ACT_SHIFT (1U)
#define AEC_AE_TMON_CHECK_SELF_ACT_WIDTH (1U)
#define AEC_AE_TMON_CHECK_SELF_ACT(x)                                                              \
    (((uint16_t)(((uint16_t)(x)) << AEC_AE_TMON_CHECK_SELF_ACT_SHIFT)) &                           \
     AEC_AE_TMON_CHECK_SELF_ACT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group AEC_AE_Register_Masks */

/*!
 * @}
 */ /* end of group AEC_AE_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_AEC_AE_H_) */
